getData = input('입력하고싶은 데이터를 작성해주세요 >> ')
print(getData)

# node.js의 바닐라 입력방식을 확인 한 뒤, 본 예제를 열람하시면 파이썬이 얼마만큼 '사람' 다운지 느껴집니다. 그래서 많은 지망생들이 파이썬의 간결함에 매료되어 '무엇이 쉬운지'를 저에게 물어보는지 그 마음을 짐작합니다. 조금 더 깊이 있는 이해가 필요해지는 시점이 반드시 찾아오는 전문가의 입장에서는, 이와 같은 간결함에, 의존의 수준이 문제가 됩니다. '무엇이 어떻게 어떤 방식으로' 라는 것이 모두 자동화 되어있기 때문입니다. 거의 모두라고 할 수 있을만큼, 파이썬의 작성법이 '선언' 이기때문에 생산성 면에서 굉장한 속도를 내지만, 반대급부로 원리를 잊게하는 원인이 되기도 합니다.


# 귀납적으로 '코드가 길어질수록 읽기 불편하다' 라는 것이, 전문가가 되어갈 수록 '명령이 모두 적혀있어, 의도를 이해하는 것에 편해진다'로 가까워지는 역설을 배제하기 어렵습니다.
# 주요 골자는 '이해의 왕도'라기 보다, '이해하기 위한 수단'을 떠올리는 훈련을 권합니다. 파이썬은 언제든지 할 수 있지만, 원리 이해는 얼마간의 물리적인 학습비용을 지불해야하는 부분이기 때문입니다.
